Repository: ryonakano/pin-it
Catalog: po/extra/*.po
Languages: cs, lt, nb_no, pl

source: Pin shortcuts for your favorite portable apps to your app launcher
cs: Vytvořte si zástupce svých oblíbených přenosných aplikací ve spouštěči aplikací
nb_no: Fest snarveier for dine portable favorittprogrammer til din programoppstarter

source: Pin shortcuts for portable apps like raw executable files, AppImage files, etc. to the app launcher on your desktop.
cs: Vytvořte zástupce přenosných aplikací, jako jsou nezpracované spustitelné soubory, soubory AppImage atd., do spouštěče aplikací vašeho desktopového prostředí.
nb_no: Fest snarveier for portable programmer som kjørbare filer i rådataformat, AppImage-filer osv. til programoppstarteren på skrivebordet ditt.

source: Other features include:
cs: Mezi další funkce patří:
lt: Kitos savybės įtraukia:
nb_no: Andre funksjoner:
pl: Inne funkcje obejmują:

source: Edit or delete created app entries without opening the file manager
cs: Upravte nebo odstraňte vytvořené položky aplikace bez otevření správce souborů
lt: Keisti arba trinti sukurtas programėlės įvestis neatidarant rinkmenų tvarkytuvės
nb_no: Rediger eller slett opprettede programoppføringer uten å åpne filbehandleren
pl: Edytuj lub usuń utworzone wpisy aplikacji bez otwierania menedżera plików

source: Automatically add execution permission to the file you select
cs: Automaticky přidejte oprávnění ke spuštění do souboru, který vyberete
lt: Pagal nutylėjimą įtraukti vykdomąsias teises tavo pasirenkamoms rinkmenoms
nb_no: Legg til kjøringstilgang automatisk for filene du velger
pl: Automatycznie dodaj uprawnienie do wykonywania do wybranego pliku

source: Syntax error detection
cs: Detekce syntaktických chyb
lt: Sintaksės klaidos paieška
pl: Wykrywanie błędów składni

source: Automatically save everything―your data in editing, last open view, and preferences
cs: Automaticky ukládejte vše – svá data při úpravách, poslední otevřené zobrazení a předvolby
lt: Pagal nutylėjimą viską išsaugoti ― tavo įvesties duomenis keitimo metu, paskutinio atidaryto rodinio metu, ir nustatymus
nb_no: Lagre alt automatisk — data i redigering, sist åpnet visning, og innstillinger
pl: Automatycznie zapisuj wszystko — Twoje dane w edytowaniu, ostatnim otwartym widoku i preferencjach

source: Files view in the light mode
cs: Zobrazení souborů ve světlém režimu
lt: Rinkmenos rodinys šviesioje veiksenoje
nb_no: Filvisning i lys drakt
pl: Widok plików w trybie światła

source: Edit view in the light mode
cs: Editace ve světlém režimu
lt: Keitimo rodinys šviesioje veiksenoje
nb_no: Redigeringsvisning i lys drakt
pl: Edytuj widok w trybie światła

source: Files view in the dark mode
cs: Zobrazení souborů v tmavém režimu
lt: Rinkmenos rodinys tamsioje veiksenoje
nb_no: Filvisning i mørk drakt
pl: Widok plików w trybie ciemnym

source: Edit view in the dark mode
cs: Editace v tmavém režimu
lt: Keitimo rodinys tamsioje veiksenoje
nb_no: Redigeringsvisning i mørk drakt
pl: Edytuj widok w trybie ciemnym

source: Update Flatpak runtime version
cs: Aktualizace verzi runtime Flatpak

source: Update translations
cs: Aktualizace překladů
lt: Vertimo naujinimas
pl: Aktualizuj tłumaczenia

source: The biggest and greatest updates come to "Pin It!":
cs: Největší a nejlepší aktualizace přicházejí do „Pin It!“:
lt: Didžiausi ir geriausi atnaujinimai kartu su "Pakišk tai!":
pl: Największe i największe aktualizacje pochodzą z "Przypnij go!":

source: Redesign to fit modern desktop environments, including support for responsive design
cs: Redesign, aby vyhovoval moderním desktopovým prostředím, včetně podpory responzivního designu
lt: Permodeliuota, kad tiktų naujoviškoms darbalaukio aplinkoms įskaitant ir grįžtamojo dizaino palaikymą
pl: Przeprojektowanie w celu dopasowania do nowoczesnych środowisk komputerów stacjonarnych, w tym obsługa projektowania responsywnego

source: Migrate to GTK 4, the latest version of GTK
cs: Přechod na GTK 4, nejnovější verzi GTK
lt: Pokytis iki GTK 4 versijos, naujausia GTK versija
pl: Migrować do GTK 4, najnowszej wersji GTK

source: Other changes:
cs: Další změny:
lt: Kiti pokyčiai:
pl: Inne zmiany:

source: Support setting ".ico" files as the app icon
cs: Podpora nastavení souborů „.ico“ jako ikony aplikace
lt: Įgyvendintas ".ico" rinkmenų nustatymas kaip programėlės ikonėlė
pl: Obsługa ustawiania plików ".ico" jako ikony aplikacji

source: Support opening in a text editor
cs: Podpora otevírání v textovém editoru
lt: Įgyvendintas atvėrimas naudojant teksto redaktorių
pl: Ustawienie otwieranie w edytorze tekstu

source: Fix window size cannot be resized on small displays
cs: Oprava - velikost okna nelze změnit na malých displejích
lt: Ištaisyta mažo dydžio vaizduokliuose kuomet neįmanoma keisti langelio dydį
pl: Zaimplementowana poprawka rozmiaru okna nie może być zmieniana na małych wyświetlaczach

source: Show error dialogs when saving/deleting failed
cs: Zobrazit chybová dialogová okna, když se ukládání/mazání nezdařilo
lt: Vaizduoti klaidų dialogo langus kuomet nepavyksta išsaugoti/ištrinti
pl: Pokaż okna dialogowe błędów podczas zapisywania/usuwania nie powiodło się

source: Make sure not to add blank elements in generated desktop files
cs: Do generovaných souborů nepřidávat prázdné prvky
lt: Pasitikrinti nepridėtų tuščių elementų formuojamuose darbalaukio rinkmenose
pl: Upewnij się, że nie dodawaj pustych elementów w wygenerowanych plikach komputerów

source: Don't overwrite the entire permission of the selected executable files
cs: Nepřepisovat všechna oprávnění vybraných spustitelných souborů
lt: Nepakeiskite pasirinktų paleidžiamųjų dokumentų programinių teisių
pl: Nie zastępuj całego uprawnienia wybranych plików wykonywalnych

source: Give executable permission for the user only when they don't have it
cs: Udělit uživateli oprávnění ke spustitelnému souboru pouze v případě, že jej nemá
lt: Paleidimo teises naudotojui teikti tik kuomet jis šių teisių neturi
pl: Daj użytkownikowi uprawnienie wykonywalne tylko wtedy, gdy go nie mają

source: AppData: Fix release year
cs: AppData: Oprava roku vydání
lt: ProgramėlėsDuomenys: Ištaisyti leidinio metai
pl: AppData: Napraw rok wydania

source: Translation updates:
cs: Aktualizace překladu:
lt: Vertimo naujiniai:
pl: Aktualizacje tłumaczenia:

source: Update Italian translation (thanks to @albanobattistella)
cs: Italský překlad (díky @albanobattistella)

source: Check desktop environment on runtime
cs: Kontrola desktopového prostředí
lt: Darbalaukio aplinkos patikra paleisties metu
pl: Sprawdź środowisko komputerów w środowisku wykonawczym

source: Lessen scope of file access
cs: Zmenšen rozsah přístupu k souborům
lt: Apriboti rinkmenos prieigą
pl: Mniejszy zakres dostępu do plików

source: Make window resizable
cs: Možnost změny velikost okna
lt: Leisti keisti langelio dydį
pl: Umożliwia zmianę rozmiaru okna

source: EditView: Less strict on file names
cs: Editace: Méně striktní na názvy souborů
lt: KeitimoRodinys: Ne toks griežtas rinkmenų užvardinimui
pl: Editview: mniej restrykcyjne dla nazw plików

source: Add Italian translation (thanks to @albanobattistella)
cs: Přidán italský překlad (díky @albanobattistella)

source: Add Dutch translation (thanks to @Vistaus)
cs: Přidán holandský překlad (díky @Vistaus)

source: Update Japanese translation
cs: Aktualizace překladu japonštiny
lt: Atnaujinti japonų išvertimą

source: Fix build error on other distros
cs: Oprava chyby sestavení v jiných distribucích
lt: Ištaisyta darinio klaida kitose distribucijose
pl: Napraw błąd kompilacji na innych distra

source: FilesView: Properly center the dialog against the app window
cs: Zobrazení souborů: Správně vycentrováno dialogové okno proti oknu aplikace
lt: RinkmenosRodinys: Tinkamai centruoti dialogo langą priešais programos langelį
pl: FileView: Prawidłowo wyśrodkuj okno dialogowe w oknie aplikacji

source: Restore last opened view and its state
cs: Obnovení naposledy otevřeného zobrazení a jeho stav
lt: Grąžinti paskutinį naudotą rodinį ir jo būseną
pl: Przywróć ostatnio otwarty widok i jego stan

source: Add new style switcher
cs: Přidán nový přepínač stylů
lt: Pridėti naują stilių perjungiklį
pl: Dodaj przełącznik nowego stylu

source: Correct titlebar label when no app name specified
cs: Opravený popisek záhlaví, když není zadán žádný název aplikace
lt: Ištaisyti pavadinimo juostos labelį kuomet nepateikiamas programėlės vardas
pl: Koryguj etykietę paska tytułu, gdy nie określono nazwy aplikacji

source: Readable copies
cs: Čitelné kopie
lt: Perskaitomos kopijos
pl: Kopie do odczytu

source: FilesView: Ellipsize if label texts are too long
cs: Zobrazení souborů: Pokud jsou texty štítků příliš dlouhé, jsou zkráceny a nahrazeny tečkami
lt: RinkmenosRodinys: Tritaškis jei labelis per ilgas
pl: FilesView: Ellipsize, jeśli teksty etykiet są zbyt długie

source: Tell accepted file formats in FileChooser
cs: Akceptované formáty souborů ve Výběru souborů
lt: Nusakyti priimtinus rinkmenų formatus Rinkmenų parinkėjui
pl: Przekaż akceptowane formaty plików w wyborze plików FileChooser

source: Add Brazilian Porguguese translation (thanks to @DanielTolentino)
cs: Přidán překlad do brazilského portugalštiny (díky @DanielTolentino)

source: EditView: Focus on file name entry by default
cs: Editace: Ve výchozím nastavení se zaměří na zadání názvu souboru
lt: KeitimoRodinys: pagal nutylėjimą susikoncentruoti ties rinkmenos įrašo įvestimi
pl: EditView: Domyślnie należy skupić się na wpisywaniu nazwy pliku

source: FilesView: Make scrollable and fix the window get bigger if many entries
cs: Zobrazení souborů: Umožnění posouvání a oprava velikosti okna při mnoha záznamech
lt: RinkmenosRodinys: Įgyvendinta slankjuostė ir tvarkingas langelio dydis perpildant daugybe įvesčių
pl: FilesView: Sprawiają, że przewijanie i naprawa okna staje się większe, jeśli wiele wpisów

source: Add French translation (thanks to @NathanBnm)
cs: Přidán francouzský překlad (díky @NathanBnm)

source: Improved support for other desktop environments
cs: Vylepšená podpora pro další desktopová prostředí
lt: Patobulintas kitų darbalaukio aplinkų palaikymas
pl: Lepsza obsługa innych środowisk stacjonarnych

source: Add execution permission on clicking the "Pin It!" button
cs: Přidáno oprávnění při kliknutí na tlačítko "Pin It!"

source: Add CategoryChooser
cs: Přidán výběr kategorií
lt: Pridėti kategorijos parinkėją
pl: Dodaj wybór kategorii CategoryChooser

source: Support Alt+Home to show welcome
cs: Podpora Alt+Home pro zobrazení uvítací obrazovky
lt: Palaikoma ALT+Home pasisveikinimo vaizdavimui
pl: Wsparcie „Alt+Home”, aby pokazać mile widziane

source: Allow GPU acceralation by default
cs: Ve výchozím nastavení povolena akcelerace GPU
lt: Pagal nutylėjimą palaikomas Grafinio Procesorinio Vieneto akceleracija
pl: Zezwalaj domyślnie na akerację procesora GPU

source: Add 128px app icon (thanks to @hanaral)
cs: Přidána ikona aplikace 128px (díky @hanaral)

source: Rounded window corners on any stylesheet (thanks to @JeysonFlores)
cs: Zaoblené rohy oken na libovolné šabloně stylů (díky @JeysonFlores)

source: Support multitouch gestures (thanks to @JeysonFlores)
cs: Podpora vícedotykových gest (díky @JeysonFlores)

source: Fix unreadable description text in AppCenter
cs: Oprava: nečitelný text popisu v centru aplikací
lt: Sutvarkyti neperskaitomą "AppCenter" informacinį pranešimą
pl: Napraw nieczytelny tekst opisu w „AppCenter”

source: Save and restore window position
cs: Uložení a obnovení pozice okna
lt: Išsaugoti ir sugrąžinti langelio vietą
pl: Zapisz i przywracaj pozycję okna

source: Add Spanish translation (thanks to @JeysonFlores)
cs: Přidán španělský překlad (díky @JeysonFlores)

source: Initial release
cs: První vydání
lt: Pradinis leidimas
pl: Wstępne zwolnienie

source: Desktop File Creator
cs: Nástroj pro tvorbu souborů na ploše
lt: Darbalaukio rinkmenų savininkas
nb_no: Skrivebordsfiloppretter
pl: Autor plików komputerów

source: Desktop;File;Create;Edit;Info;Icon;AppImage;
lt: Darbalaukis;Rinkmena;Sukurti;Keisti;Informacija;Ikonėlė;Programos atvaizdas;
nb_no: Skrivebord;fil;opprett;rediger;info;ikon;AppImage;
pl: Komputer;Plik;Autor;Edytuj;Informacje;Ikona;Obraz aplikacji;
