Repository: ryonakano/pin-it
Catalog: po/*.po
Languages: it, lt, sk

source: Cannot open %s: %s
it: Impossibile aprire %s: %s
lt: Neįmanoma atverti %s: %s
sk: Nedá sa otvoriť %s: %s

source: Audio
lt: Audio įrašų programa
sk: Zvuk

source: Education
it: Istruzione
lt: Programa mokinimuisi
sk: Vzdelávanie

source: Graphics
it: Grafica
lt: Grafikos programa
sk: Grafika

source: Office
it: Ufficio
lt: Biuro programa
sk: Kancelária

source: Science
it: Scienza
lt: Mokslinių tyrimų programa
sk: Veda

source: Settings
it: Impostazioni
lt: Nustatymų programa
sk: Nastavenia

source: Updated entry.
it: Voce aggiornata.
lt: Atnaujinta įvestis.
sk: Položka aktualizovaná.

source: Deleted entry.
it: Voce eliminata.
lt: Ištrinta įvestis.
sk: Položka odstránená.

source: Pin shortcuts for your favorite portable apps to your app launcher
it: Aggiungi scorciatoie per le tue app portatili preferite al tuo app launcher
sk: Pin skratky pre vaše obľúbené prenosné aplikácie na spustenie aplikácie

source: translator-credits
it: Albano Battistella
lt: polpolylingo
sk: John Dumpling

source: Save
it: Salva
lt: Išsaugoti
sk: Uložiť

source: File Name
it: Nome File
lt: Rinkmenos pavadinimas
sk: Názov súboru

source: Name of the .desktop file, where this app's info will be saved.
it: Nome del file .desktop, in cui verranno salvate le informazioni di questa app.
sk: Názov . desktopový súbor, kde budú uložené informácie tejto aplikácie.

source: Suffix of the file
it: Suffisso del file
lt: Rinkmenos pavadinimo praplėtinys
sk: Koncovka súboru

source: App Name
it: Nome App
lt: Programos pavadinimas
sk: Názov aplikácie

source: Shown in the launcher or dock.
it: Mostrato nel launcher o nella dock.
sk: Shown v spúšťacom alebo docku.

source: Comment
it: Commento
lt: Komentaras
sk: Komentár

source: Descibes the app. May appear as a tooltip when you hover over the app entry in the launcher/dock.
it: Descrive l'app. Può apparire come suggerimento quando passi con il mouse sopra la voce dell'app nel launcher/dock.
sk: Opíšte aplikáciu. Môže sa objaviť ako nástrojtip, keď ste hover cez vstup aplikácie v spúšťacom / púčika.

source: Exec File
it: File esecutivo
lt: Vykdomoji rinkmena
sk: Spustiteľný súbor

source: The command/app launched when you click the app entry in the launcher. Specify in an absolute path or an app's alias name.
it: Il comando/l'app è avviata quando si fa clic sulla voce dell'app nel programma di avvio. Specificare in un percorso assoluto o il nome alias di un'app.
lt: Paleidiklyje paspaudus ant programėlės įvesties yra įgyvendinama komanda/paleidžiama programa. Nustatyti visą kelią arba pateikti šios programėlės alternatyvų vardą.
sk: Príkaz/aplikácia, ktorá bude spustená po kliknutí na položku aplikácie v spúšťači. Upresnite v absolútnom popise umiestnenia alebo v aliase názvu aplikácie.

source: Icon File
it: Icona File
lt: Rinkmenos ikonėlė
sk: Súbor ikonky

source: The icon branding the app. Specify in an absolute path or an icon's alias name.
it: L'icona che contraddistingue l'app. Specifica in un percorso assoluto il nome o l'alias dell'icona.
lt: Ikonėlė naudojama kaip oficialus programos logotipas. Nustatyti visą kelią arba pateikti šios ikonėlės alternatyvų vardą.
sk: Ikonka označujúca aplikáciu. Upravte v absolútnom popise umiestnenia alebo v aliase názvu ikonky.

source: App Categories
it: Categorie di app
lt: Programos kategorija
sk: Kategórie aplikácie

source: Categories applicable to the app. (You can select more than one.)
it: Categorie applicabili all'app. (Puoi selezionarne più di una.)
sk: Kategórie uplatniteľné na aplikáciu. (Môžete si vybrať viac ako jeden.)

source: Advanced configuration
it: Configurazione avanzata
lt: Išplėstiniai nustatymai
sk: Pokročilé nastavenie

source: You can create most app entries just by filling in the sections above. However, some apps may require the advanced configuration options below.
it: Puoi creare la maggior parte delle voci delle app semplicemente compilando le sezioni precedenti. Tuttavia, alcune app potrebbero richiedere le seguenti opzioni di configurazione avanzate.
sk: Môžete vytvoriť väčšinu položiek aplikácie len vyplnením sekcií vyššie. Avšak, niektoré aplikácie môžu vyžadovať pokročilé možnosti konfigurácie nižšie.

source: Startup WM Class
it: Classe WM di avvio
lt: WM klasė paleidimo metu
sk: Trieda spustenia WM

source: Associate the app with a window that has this ID. Use this if a different or duplicated icon appears in the dock when the app launches.
it: Associa l'app a una finestra con questo ID. Utilizzare questa opzione se nel dock viene visualizzata un'icona diversa o duplicata all'avvio dell'app.
sk: Pripojiť aplikáciu s oknom, ktoré má toto ID. Použite to, ak sa objaví iná alebo duplicitná ikona v doku, keď aplikácia začne.

source: Run in Terminal
it: Esegui nel terminale
lt: Paleisti terminalinėje eilutėje
sk: Spustiť v termináli

source: Check this if you want to register a CUI app.
it: Selezionare questa opzione se si desidera registrare un'app CUI.
sk: Skontrolujte, či chcete zaregistrovať aplikáciu CUI.

source: Open in text editor
it: Apri nell'editor di testo
lt: Atverti teksto redaktoriuje
sk: Otvoriť v editore textu

source: You can also edit more options by opening in a text editor.
it: Puoi anche modificare più opzioni aprendo un editor di testo.
lt: Atvėrus teksto redaktorių yra daugiau redagavimo parinkčių.
sk: Ďalšie možnosti môžete upraviť taktiež otvorením v textovom editore.

source: Select an executable file
it: Seleziona un file eseguibile
lt: Pasirinkti vykdomąją rinkmeną
sk: Vybrať spustiteľný súbor

source: Select
it: Seleziona
sk: Vybrať

source: ICO, PNG, SVG, or XMP files
it: File ICO, PNG, SVG o XMP
lt: ICO, PNG, SVG, arba XMP rinkmenos
sk: Súbory ICO, PNG, SVG alebo XMP

source: Select an icon file
it: Seleziona un file icona
lt: Pasirinkti ikonėlės rinkmeną
sk: Vybrať súbor ikonky

source: Could not open with external app
it: Impossibile aprire con un'app esterna
lt: Neįmanoma atverti naudojant išorinę programėlę
sk: Nepodarilo sa otvoriť pomocou externej aplikácie

source: Close
it: Chiudi
lt: Uždaryti
sk: Zatvoriť

source: New Entry
it: Nuova Voce
lt: Nauja įvestis
sk: Nová položka

source: Editing Entry
it: Modifica Voce
lt: Keisti įvestį
sk: Úprava položky

source: Editing “%s”
it: Modifica di «%s»
lt: Keisti „%s“
sk: Úprava „%s“

source: Cancel
it: Cancella
lt: Atšaukti
sk: Zrušiť

source: Could not write to file “%s”
it: Impossibile scrivere nel file “%s”
lt: Neišeina įrašyti į rinkmeną „%s“
sk: Nepodarilo sa zapísať do súboru „%s“

source: Recommendations for naming
it: Raccomandazioni per la denominazione
lt: Įvardinimo rekomendacijos
sk: Odporúčania na pomenovávanie

source: It is recommended to use only alphanumeric characters and underscores. Don't begin with a number.
it: Si consiglia di utilizzare solo caratteri alfanumerici e trattini bassi. Non iniziare con un numero.
sk: Odporúča sa používať iba alfa znakov a podčiarkov. Nepoužívajte číslo.

source: Include at least two elements (sections of the string seperated by a period). Most apps use three elements.
it: Includere almeno due elementi (sezioni della stringa separate da un punto). La maggior parte delle app utilizza tre elementi.
sk: Zahrňte aspoň dve prvky (sekcia reťazca seperované obdobím). Väčšina aplikácií používa tri prvky.

source: For example, you should use "%s" for the 2D game, SuperTux.
it: Ad esempio, dovresti usare "%s" per il gioco 2D, SuperTux.
lt: Pavyzdžiui, tau reikia naudoti "%s" 2D žaidimui, „SuperTux“.
sk: Napríklad pre 2D hru SuperTux by ste mali použiť "%s".

source: For more info, see %s.
it: Per maggiori informazioni, vedi %s.
lt: Daugiau, žiū. %s.
sk: Pre viac informácií viď %s.

source: the file naming specification by freedesktop.org
it: la specifica di denominazione dei file di freedesktop.org
lt: rinkmenos užvadinimo specifikacija pagal freedesktop.org
sk: špecifiká pomenovávania súborov od freedesktop.org

source: Create a new entry
it: Crea una nuova voce
lt: Kurti naują įvestį
sk: Vytvoriť novú položku

source: Light
it: Chiaro
lt: Šviesus
sk: Svetlý

source: Dark
it: Scuro
lt: Tamsus
sk: Tmavý

source: System
it: Sistema
lt: Sistema
sk: Systém

source: Style
it: Stile
lt: Stilius
sk: Štýl

source: Preferences
it: Preferenze
lt: Nustatymai
sk: Predvoľby

source: No valid app entries found
it: Nessuna voce valida per l'app trovata
lt: Nebuvo rasta tinkamos programėlės įvesties
sk: Neboli nájdené žiadne platné položky aplikácií

source: If you've never created one, click the + button on the top.
it: Se non ne hai mai creato uno, clicca sul pulsante + in alto.
lt: Jeigu nemėginai įgyvendinti spausk Plius mygtuką viršuje.
sk: Ak ste nikdy nijakú nevytvorili, kliknite na tlačidlo + navrchu.

source: Delete…
it: Elimina…
lt: Ištrinti…
sk: Odstrániť…

source: Are you sure you want to delete “%s”?
it: Sei sicuro/a di voler eliminare «%s»?
lt: Ar esi tikras, kad nori ištrinti „%s“?
sk: Naozaj chcete odstrániť „%s“?

source: This removes the app from the launcher.
it: Questo rimuove l'app dal launcher.
lt: Tai pašalina programėlę iš paleidiklio.
sk: Toto odstráni aplikáciu zo spúšťača.

source: Delete
it: Elimina
lt: Ištrinti
sk: Odstrániť

source: Could not delete file “%s”
it: Impossibile eliminare il file “%s”
lt: Neįmanoma ištrinti rinkmenos „%s“
sk: Nepodarilo sa odstrániť súbor „%s“

source: Video
lt: Vaizdo įrašų programa
